## Plan Result (sandbox-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 5 to destroy.</code></pre>

* Replace
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc/providers/Microsoft.Authorization/roleAssignments/0c43e4a7-86b9-4bad-37c6-1a6bf4c8989f" -> (known after apply)
      ~ name                             = "0c43e4a7-86b9-4bad-37c6-1a6bf4c8989f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9/providers/Microsoft.Authorization/roleAssignments/43f7ee79-565c-0501-03b9-9d3be746941c" -> (known after apply)
      ~ name                             = "43f7ee79-565c-0501-03b9-9d3be746941c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488/providers/Microsoft.Authorization/roleAssignments/52f90110-86d1-87c0-d4a6-1401716e7837" -> (known after apply)
      ~ name                             = "52f90110-86d1-87c0-d4a6-1401716e7837" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0/providers/Microsoft.Authorization/roleAssignments/7894f006-a9ce-b95c-627c-a76e58c4332e" -> (known after apply)
      ~ name                             = "7894f006-a9ce-b95c-627c-a76e58c4332e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3/providers/Microsoft.Authorization/roleAssignments/39f106d5-4c3a-170e-8936-0a805bf0d804" -> (known after apply)
      ~ name                             = "39f106d5-4c3a-170e-8936-0a805bf0d804" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":75,"Program":"tfcmt","SHA1":"","Target":"sandbox-enterprise","Vars":{}} -->